       IDENTIFICATION DIVISION.
       PROGRAM-ID. DARTS.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-X PIC 99V9.
       01 WS-Y PIC 99V9.
       01 RAD  PIC 99V9999.
       01 TMP  PIC 999V9999.
       01 WS-RESULT PIC 99.
       PROCEDURE DIVISION.
       DARTS.
         COMPUTE TMP = WS-X * WS-X + WS-Y * WS-Y.
         MOVE FUNCTION SQRT(TMP) TO RAD.
         IF RAD IS LESS THAN OR EQUAL TO 1.0
            MOVE 10 TO WS-RESULT
         ELSE IF RAD IS GREATER THAN 1 AND LESS THAN OR EQUAL TO 5.0
            MOVE 5 TO WS-RESULT
         ELSE IF RAD IS GREATER THAN 5.0 AND LESS THAN OR EQUAL TO 10.0
            MOVE 1 TO WS-RESULT
         ELSE IF RAD IS GREATER THAN 10.0
            MOVE 0 TO WS-RESULT
         END-IF.